import streamlit as st
import numpy as np
import pandas as pd

# Draw a histogram
chart_data = pd.read_csv('crimeTime.csv')

tab1, tab2, tab3, tab4 = st.tabs(["全部", "竊盜", "傷害、妨害自由及詐欺", "其他"])

with tab1:
    st.subheader('台灣歷年犯罪型態')
    st.bar_chart(chart_data, x = "年度", y=['重大竊盜', '普通竊盜', '汽車竊盜', '機車竊盜','重傷害', '一般傷害', '妨害自由', '詐欺','贓物', '賭博', '背信', '重利', '妨害自由', '擄人勒贖', '侵占', '偽造文書印文', '第一級毒品', '第二級毒品', '第三級毒品', '第四級毒品', '其他毒品', '毀棄損壞', '妨害公務', '強盜', '搶奪', '竊佔', '偽造有價證券', '故意殺人', '過失致死', '駕駛過失', '妨害婚姻及家庭', '妨害風化', '強制性交', '共同強制性交', '對幼性交', '性交猥褻', '內亂', '重大恐嚇取財', '一般恐嚇取財', '妨害秩序', '違反藥事法', '違反國家總動員法', '違反森林法', '違反著作權法', '違反商標法', '公共危險', '侵害墳墓屍體', '妨害名譽', '違反選罷法', '妨害秘密', '遺棄', '懲治走私條例', '違反貪汙治罪條例', '瀆職', '妨害兵役', '偽造貨幣', '偽造度量衡', '偽證', '誣告', '湮滅證據', '藏匿頂替', '脫逃', '違反槍砲彈藥刀械管制條例', '違反就業服務法', '妨害電腦使用', '其他', '暴力犯罪'])

with tab2:
    st.subheader('竊盜')
    st.line_chart(chart_data, x = "年度", y=['重大竊盜', '普通竊盜', '汽車竊盜', '機車竊盜'])

with tab3:
    st.subheader('傷害、妨害自由及詐欺')
    st.line_chart(chart_data, x = "年度", y=['重傷害', '一般傷害', '妨害自由', '詐欺'])

with tab4:
    st.subheader('其他')
    st.line_chart(chart_data, x = "年度", y=['贓物', '賭博', '背信', '重利'])
